# EndStation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelSetOptions..::..EndStation Property
AlignmentStationLabelSetOptions Class See Also
---
The ending station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's DisplayedEndStation is used.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public Nullable<double> EndStation { get; set; }
```

Visual Basic
---
```text
Public Property EndStation As Nullable(Of Double)
	Get
	Set
```

Visual C++
---
```text
public:
property Nullable<double> EndStation {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
```

# See Also
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace